import pandas as pd

def grab_data_from_excel(file_path, selected_data_list):
    df = pd.read_excel(file_path)
    # contract_data = df[df['生效合約編號'] == contract_number]  # 修改为实际的合约编号列名
    contract_data = df[(df["生效合約編號"] == selected_data_list[0]) & (df["市調合約編號"] == selected_data_list[1]) & (df["合約生效日"] == int(selected_data_list[2])) & (df["合約截止日"] == int(selected_data_list[3]))]
    if contract_data.empty:
        # print("找不到相應的生效合約編號")
        return None
    
    data = {
        "A0": contract_data['生效合約編號'].values[0],
        "A1": contract_data['適用地區名稱'].values[0],
        "A2": contract_data['主要用料部門-公司簡稱'].values[0]+contract_data['主要用料部門-部門名稱'].values[0],
        "A3": contract_data['合約名稱'].values[0],
        "A4": contract_data['前次訂約廠商簡稱'].values[0],
        "A5": contract_data['立案類型名稱'].values[0],
        "A6": contract_data['規格數量'].values[0],
        "A7": contract_data['呈核類型名稱'].values[0],
        "A8": contract_data['原合約年採購金額'].values[0],
        "B1": contract_data['報價廠商數'].values[0],
        "B2": contract_data['擬訂約廠商簡稱'].values[0],
        "B3": contract_data['擬訂約單價'].values[0],
        "B4": contract_data['前次合約約單價'].values[0],
        "B5": contract_data['議價調幅'].values[0],
        #"B6": contract_data['擬辦說明'].values[index-1],
        #"B7": contract_data['AI判斷漲跌幅合理性'].values[index-1],
        "C1": str(contract_data['合約生效日'].values[0]) + "~" + str(contract_data['合約截止日'].values[0]),
        "C2": contract_data['擬訂約總金額'].values[0],
    }
    data = transform_data(data)
    return data

def transform_data(data):
    if data["A5"] == "合約到期前45天(或90天)立案":
        data["A5"] = "屆期"
    elif data["A5"] == "主原料波動達價格連動設定比率":
        data["A5"] = "期內原料波動大"
    elif data["A5"] == "週期市調立案":
        data["A5"] = "期內週期市調"
    elif data["A5"] == "累積訂量金額超出前期年用量30%":
        data["A5"] = "期內用量超出前期年用量"
    
    if data["A8"] < 100000000:
        data["A8"] = str("{:,}".format(int(data["A8"]/10000)))+"萬元/年"
    elif data["A8"] > 100000000:
        data["A8"] = str("{:,}".format(int(data["A8"]/10000000)))+"億元/年"

    if data["C2"] < 100000000:
        data["C2"] = str("{:,}".format(int(data["C2"]/10000)))+"萬元/年"
    elif data["C2"] > 100000000:
        data["C2"] = str("{:,}".format(int(data["C2"]/10000000)))+"億元/年"

    C1_start = data["C1"].split("~")[0]
    year = int(C1_start[:-4]) + 1911
    month = int(C1_start[-4:-2])
    day = int(C1_start[-2:])
    C1_start = f"{year}.{month}/{day}"
    
    C1_end = data["C1"].split("~")[1]
    year = int(C1_end[:-4]) + 1911
    month = int(C1_end[-4:-2])
    day = int(C1_end[-2:])
    C1_end = f"{year}.{month}/{day}"
    data["C1"] = C1_start + "~" + C1_end

    return data

def generate_audit_report(item, data):
    templates = {
        1: "全企業【A1】用【A3】，目前以一般採購辦理；現為簡化作業，擬辦理合約。\n"
           "採購部上網招標僅【B2】報價，經使用部門確認規格符合要求；議後價【B3】，較前一般採購價【B4】高【B5】%，係因【B6】，擬向其訂約。\n"
           "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        2: "全企業【A1】用【A3】，目前以一般採購辦理；現為簡化作業，擬辦理合約。\n"
            "採購部上網招標僅【B2】報價，經使用部門確認規格符合要求；議後價【B3】，同前一般採購價，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        3: "全企業【A1】用【A3】，目前以一般採購辦理；現為簡化作業，擬辦理合約。\n"
            "採購部上網招標僅【B2】報價，經使用部門確認規格符合要求；議後價【B3】，較前一般採購價【B4】低【B5】%，係因【B6】，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        4: "全企業【A1】用【A3】，目前以一般採購辦理；現為簡化作業，擬辦理合約。\n"
            "採購部上網招標僅【B2】報價，經使用部門確認規格符合要求；議後價【B3】，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        5: "全企業【A1】用【A3】，目前以一般採購辦理；現為簡化作業，擬辦理合約。\n"
            "採購部上網招標共【B1】家報價，經使用部門確認規格皆符合要求；以【B2】議後價【B3】最低，較前一般採購價【B4】高【B5】%，係因【B6】，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        6: "全企業【A1】用【A3】，目前以一般採購辦理；現為簡化作業，擬辦理合約。\n"
            "採購部上網招標共【B1】家報價，經使用部門確認規格皆符合要求；以【B2】議後價【B3】最低，同前一般採購價，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        7: "全企業【A1】用【A3】，目前以一般採購辦理；現為簡化作業，擬辦理合約。\n"
            "採購部上網招標共【B1】家報價，經使用部門確認規格皆符合要求；以【B2】議後價【B3】最低，較前一般採購價【B4】低【B5】%，係因【B6】，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        8: "全企業【A1】用【A3】，目前以一般採購辦理；現為簡化作業，擬辦理合約。\n"
            "採購部上網招標共【B1】家報價，經使用部門確認規格皆符合要求；以【B2】議後價【B3】最低，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        9: "全企業【A1】用【A3】【A6】項規格，目前以一般採購辦理；現為簡化作業，擬辦理合約。\n"
            "採購部上網招標僅【B2】報價，經使用部門確認規格符合要求；議後平均較前一般採購價高【B5】%，係因【B6】，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        10: "全企業【A1】用【A3】【A6】項規格，目前以一般採購辦理；現為簡化作業，擬辦理合約。\n"
            "採購部上網招標僅【B2】報價，經使用部門確認規格符合要求；議後平均同前一般採購價，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        11: "全企業【A1】用【A3】【A6】項規格，目前以一般採購辦理；現為簡化作業，擬辦理合約。\n"
            "採購部上網招標僅【B2】報價，經使用部門確認規格符合要求；議後平均較前一般採購價低【B5】%，係因【B6】，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        12: "全企業【A1】用【A3】【A6】項規格，目前以一般採購辦理；現為簡化作業，擬辦理合約。\n"
            "採購部上網招標僅【B2】報價，經使用部門確認規格符合要求，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        13: "全企業【A1】用【A3】【A6】項規格，目前以一般採購辦理；現為簡化作業，擬辦理合約。\n"
            "採購部上網招標共【B1】家報價，經使用部門確認規格皆符合要求；以【B2】議後價最低，平均較前一般採購價高【B5】%，係因【B6】，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        14: "全企業【A1】用【A3】【A6】項規格，目前以一般採購辦理；現為簡化作業，擬辦理合約。\n"
            "採購部上網招標共【B1】家報價，經使用部門確認規格皆符合要求；以【B2】議後價最低，平均同前一般採購價，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        15: "全企業【A1】用【A3】【A6】項規格，目前以一般採購辦理；現為簡化作業，擬辦理合約。\n"
            "採購部上網招標共【B1】家報價，經使用部門確認規格皆符合要求；以【B2】議後價最低，平均較前一般採購價低【B5】%，係因【B6】，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        16: "全企業【A1】用【A3】【A6】項規格，目前以一般採購辦理；現為簡化作業，擬辦理合約。\n"
            "採購部上網招標共【B1】家報價，經使用部門確認規格皆符合要求；以【B2】議後價最低，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        17: "全企業【A1】用【A3】，目前向【A4】合約採購，金額約【A8】；現合約【A5】，擬重新辦理。\n"
            "採購部上網招標僅【B2】報價，經使用部門確認規格符合要求；議後價【B3】，較原向【A4】合約價【B4】高【B5】%，係因【B6】，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        18: "全企業【A1】用【A3】，目前向【A4】合約採購，金額約【A8】；現合約【A5】，擬重新辦理。\n"
            "採購部上網招標僅【B2】報價，經使用部門確認規格符合要求；議後價【B3】，同原向【A4】合約價，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        19: "全企業【A1】用【A3】，目前向【A4】合約採購，金額約【A8】；現合約【A5】，擬重新辦理。\n"
            "採購部上網招標僅【B2】報價，經使用部門確認規格符合要求；議後價【B3】，較原向【A4】合約價【B4】低【B5】%，係因【B6】，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        20: "全企業【A1】用【A3】，目前向【A4】合約採購，金額約【A8】；現合約【A5】，擬重新辦理。\n"
            "採購部上網招標共【B1】家報價，經使用部門確認規格皆符合要求；以【B2】議後價最低，較原向【A4】合約價【B4】高【B5】%，係因【B6】，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        21: "全企業【A1】用【A3】，目前向【A4】合約採購，金額約【A8】；現合約【A5】，擬重新辦理。\n"
            "採購部上網招標共【B1】家報價，經使用部門確認規格皆符合要求；以【B2】議後價最低，同原向【A4】合約價，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        22: "全企業【A1】用【A3】，目前向【A4】合約採購，金額約【A8】；現合約【A5】，擬重新辦理。\n"
            "採購部上網招標共【B1】家報價，經使用部門確認規格皆符合要求；以【B2】議後價最低，較原向【A4】合約價【B4】低【B5】%，係因【B6】，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        23: "全企業【A1】用【A3】【A6】項規格，目前向【A4】合約採購，金額約【A8】；現合約【A5】，擬重新辦理。\n"
            "採購部上網招標僅【B2】報價，經使用部門確認規格符合要求；議後平均較原向【A4】合約價高【B5】%，係因【B6】，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        24: "全企業【A1】用【A3】【A6】項規格，目前向【A4】合約採購，金額約【A8】；現合約【A5】，擬重新辦理。\n"
            "採購部上網招標僅【B2】報價，經使用部門確認規格符合要求；議後平均同原向【A4】合約價，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        25: "全企業【A1】用【A3】【A6】項規格，目前向【A4】合約採購，金額約【A8】；現合約【A5】，擬重新辦理。\n"
            "採購部上網招標僅【B2】報價，經使用部門確認規格符合要求；議後平均較原向【A4】合約價低【B5】%，係因【B6】，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        26: "全企業【A1】用【A3】【A6】項規格，目前向【A4】合約採購，金額約【A8】；現合約【A5】，擬重新辦理。\n"
            "採購部上網招標共【B1】家報價，經使用部門確認規格皆符合要求；以【B2】議後價最低，平均較原向【A4】合約價高【B5】%，係因【B6】，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        27: "全企業【A1】用【A3】【A6】項規格，目前向【A4】合約採購，金額約【A8】；現合約【A5】，擬重新辦理。\n"
            "採購部上網招標共【B1】家報價，經使用部門確認規格皆符合要求；以【B2】議後價最低，平均同原向【A4】合約價，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        28: "全企業【A1】用【A3】【A6】項規格，目前向【A4】合約採購，金額約【A8】；現合約【A5】，擬重新辦理。\n"
            "採購部上網招標共【B1】家報價，經使用部門確認規格皆符合要求；以【B2】議後價最低，平均較原向【A4】合約價低【B5】%，係因【B6】，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        29: "【A2】用【A3】，目前以一般採購辦理；現為簡化作業，擬辦理合約。\n"
            "採購部上網招標僅【B2】報價，經使用部門確認規格符合要求；議後價【B3】，較前一般採購價【B4】高【B5】%，係因【B6】，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        30: "【A2】用【A3】，目前以一般採購辦理；現為簡化作業，擬辦理合約。\n"
            "採購部上網招標僅【B2】報價，經使用部門確認規格符合要求；議後價【B3】，同前一般採購價，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        31: "【A2】用【A3】，目前以一般採購辦理；現為簡化作業，擬辦理合約。\n"
            "採購部上網招標僅【B2】報價，經使用部門確認規格符合要求；議後價【B3】，較前一般採購價【B4】低【B5】%，係因【B6】，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        32: "【A2】用【A3】，目前以一般採購辦理；現為簡化作業，擬辦理合約。\n"
            "採購部上網招標僅【B2】報價，經使用部門確認規格符合要求；議後價【B3】，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        33: "【A2】用【A3】，目前以一般採購辦理；現為簡化作業，擬辦理合約。\n"
            "採購部上網招標共【B1】家報價，經使用部門確認規格皆符合要求；以【B2】議後價【B3】最低，較前一般採購價【B4】高【B5】%，係因【B6】，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        34: "【A2】用【A3】，目前以一般採購辦理；現為簡化作業，擬辦理合約。\n"
            "採購部上網招標共【B1】家報價，經使用部門確認規格皆符合要求；以【B2】議後價【B3】最低，同前一般採購價，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        35: "【A2】用【A3】，目前以一般採購辦理；現為簡化作業，擬辦理合約。\n"
            "採購部上網招標共【B1】家報價，經使用部門確認規格皆符合要求；以【B2】議後價【B3】最低，較前一般採購價【B4】低【B5】%，係因【B6】，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        36: "【A2】用【A3】，目前以一般採購辦理；現為簡化作業，擬辦理合約。\n"
            "採購部上網招標共【B1】家報價，經使用部門確認規格皆符合要求；以【B2】議後價【B3】最低，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        37: "【A2】用【A3】【A6】項規格，目前以一般採購辦理；現為簡化作業，擬辦理合約。\n"
            "採購部上網招標僅【B2】報價，經使用部門確認規格符合要求；議後平均較前一般採購價高【B5】%，係因【B6】，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        38: "【A2】用【A3】【A6】項規格，目前以一般採購辦理；現為簡化作業，擬辦理合約。\n"
            "採購部上網招標僅【B2】報價，經使用部門確認規格符合要求；議後平均同前一般採購價，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        39: "【A2】用【A3】【A6】項規格，目前以一般採購辦理；現為簡化作業，擬辦理合約。\n"
            "採購部上網招標僅【B2】報價，經使用部門確認規格符合要求；議後平均較前一般採購價低【B5】%，係因【B6】，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        40: "【A2】用【A3】【A6】項規格，目前以一般採購辦理；現為簡化作業，擬辦理合約。\n"
            "採購部上網招標僅【B2】報價，經使用部門確認規格符合要求，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        41: "【A2】用【A3】【A6】項規格，目前以一般採購辦理；現為簡化作業，擬辦理合約。\n"
            "採購部上網招標共【B1】家報價，經使用部門確認規格皆符合要求；以【B2】議後價最低，平均較前一般採購價高【B5】%，係因【B6】，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        42: "【A2】用【A3】【A6】項規格，目前以一般採購辦理；現為簡化作業，擬辦理合約。\n"
            "採購部上網招標共【B1】家報價，經使用部門確認規格皆符合要求；以【B2】議後價最低，平均同前一般採購價，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        43: "【A2】用【A3】【A6】項規格，目前以一般採購辦理；現為簡化作業，擬辦理合約。\n"
            "採購部上網招標共【B1】家報價，經使用部門確認規格皆符合要求；以【B2】議後價最低，平均較前一般採購價低【B5】%，係因【B6】，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        44: "【A2】用【A3】【A6】項規格，目前以一般採購辦理；現為簡化作業，擬辦理合約。\n"
            "採購部上網招標共【B1】家報價，經使用部門確認規格皆符合要求；以【B2】議後價最低，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        45: "【A2】用【A3】，目前向【A4】合約採購，金額約【A8】；現合約【A5】，擬重新辦理。\n"
            "採購部上網招標僅【B2】報價，經使用部門確認規格符合要求；議後價【B3】，較原向【A4】合約價【B4】高【B5】%，係因【B6】，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        46: "【A2】用【A3】，目前向【A4】合約採購，金額約【A8】；現合約【A5】，擬重新辦理。\n"
            "採購部上網招標僅【B2】報價，經使用部門確認規格符合要求；議後價【B3】，同原向【A4】合約價，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        47: "【A2】用【A3】，目前向【A4】合約採購，金額約【A8】；現合約【A5】，擬重新辦理。\n"
            "採購部上網招標僅【B2】報價，經使用部門確認規格符合要求；議後價【B3】，較原向【A4】合約價【B4】低【B5】%，係因【B6】，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        48: "【A2】用【A3】，目前向【A4】合約採購，金額約【A8】；現合約【A5】，擬重新辦理。\n"
            "採購部上網招標共【B1】家報價，經使用部門確認規格皆符合要求；以【B2】議後價最低，較原向【A4】合約價【B4】高【B5】%，係因【B6】，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        49: "【A2】用【A3】，目前向【A4】合約採購，金額約【A8】；現合約【A5】，擬重新辦理。\n"
            "採購部上網招標共【B1】家報價，經使用部門確認規格皆符合要求；以【B2】議後價最低，同原向【A4】合約價，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        50: "【A2】用【A3】，目前向【A4】合約採購，金額約【A8】；現合約【A5】，擬重新辦理。\n"
            "採購部上網招標共【B1】家報價，經使用部門確認規格皆符合要求；以【B2】議後價最低，較原向【A4】合約價【B4】低【B5】%，係因【B6】，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        51: "【A2】用【A3】【A6】項規格，目前向【A4】合約採購，金額約【A8】；現合約【A5】，擬重新辦理。\n"
            "採購部上網招標僅【B2】報價，經使用部門確認規格符合要求；議後平均較原向【A4】合約價高【B5】%，係因【B6】，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        52: "【A2】用【A3】【A6】項規格，目前向【A4】合約採購，金額約【A8】；現合約【A5】，擬重新辦理。\n"
            "採購部上網招標僅【B2】報價，經使用部門確認規格符合要求；議後平均同原向【A4】合約價，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        53: "【A2】用【A3】【A6】項規格，目前向【A4】合約採購，金額約【A8】；現合約【A5】，擬重新辦理。\n"
            "採購部上網招標僅【B2】報價，經使用部門確認規格符合要求；議後平均較原向【A4】合約價低【B5】，係因【B6】，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        54: "【A2】用【A3】【A6】項規格，目前向【A4】合約採購，金額約【A8】；現合約【A5】，擬重新辦理。\n"
            "採購部上網招標共【B1】家報價，經使用部門確認規格皆符合要求；以【B2】議後價最低，平均較原向【A4】合約價高【B5】%，係因【B6】，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        55: "【A2】用【A3】【A6】項規格，目前向【A4】合約採購，金額約【A8】；現合約【A5】，擬重新辦理。\n"
            "採購部上網招標共【B1】家報價，經使用部門確認規格皆符合要求；以【B2】議後價最低，平均同原向【A4】合約價，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
        56: "【A2】用【A3】【A6】項規格，目前向【A4】合約採購，金額約【A8】；現合約【A5】，擬重新辦理。\n"
            "採購部上網招標共【B1】家報價，經使用部門確認規格皆符合要求；以【B2】議後價最低，平均較原向【A4】合約價低【B5】%，係因【B6】，擬向其訂約。\n"
            "請 准予辦理。(合約期間：【C1】，採購金額約【C2】)",
    }
    
    if item not in templates:
        return "未定義"

    report_template = templates[item]
    for key, value in data.items():
        report_template = report_template.replace(f"【{key}】", "「" + str(value) + "」")
    
    return report_template

